package consts

import "github.com/fatih/color"

var StationNames = map[int]string{
	1:  "Райымбек батыра",
	2:  "Жибек жолы",
	3:  "Алмалы",
	4:  "Абая",
	5:  "Байконыр",
	6:  "Театр имени Мухтара Ауэзова",
	7:  "Алатау",
	8:  "Сайран",
	9:  "Москва",
	10: "Сарыарка",
	11: "Б.Момышулы",
}

var Welcome = color.GreenString(`
 __  __ ______ _______ _____   ____       _____ _      _____ 
 |  \/  |  ____|__   __|  __ \ / __ \    / ____| |    |_   _|
 | \  / | |__     | |  | |__) | |  | |  | |    | |      | |  
 | |\/| |  __|    | |  |  _  /| |  | |  | |    | |      | |  
 | |  | | |____   | |  | | \ \| |__| |  | |____| |____ _| |_ 
 |_|  |_|______|  |_|  |_|  \_\\____/    \_____|______|_____|
                                                            `) + color.HiBlueString(`
Расписание метро в Алматы`) + `
` + color.CyanString(`Примеры использования:
  metroCLI -s 5        # Просмотр расписания для станции номер 5
  metroCLI -a -s 2     # Показать полную таблицу расписания для станции номер 2
  metroCLI -h          # Показать справку
`)
